Revit 2026 API

# SystemsAnalysisReportStyle Enumeration

---

The report style of systems analysis.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SystemsAnalysisReportStyle
```
```vb
Public Enumeration SystemsAnalysisReportStyle
```
```cpp
public enum class SystemsAnalysisReportStyle
```
```fsharp
type SystemsAnalysisReportStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Detailed | 0 | The detailed report style. |
| Loads | 1 | The loads report style. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace